packages/pybFoam/pybfoam-0.1.4.tar.gz/pybfoam-0.1.4/tests/pybind/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir
touch test.foam
runApplication blockMesh

# runApplication setFields

# runApplication $(getApplication)
# foamSequenceVTKFiles -vtp
#------------------------------------------------------------------------------
